Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: If the application is explicitly canceled, the checkpoint is deleted.
zh_cn: 如果应用被显式取消，则检查点会删除。

source: If the application is not started from a checkpoint or savepoint, the state will be initially empty.
zh_cn: 如果应用不是从检查点或保存点启动，那状态就会初始化为空。

source: If the application is started without existing state, the reading offsets must be
zh_cn: 如果应用在没有状态的情况下启动，则读取偏移需要被设置成默认值。

source: If the application runs in a local execution environment the parallelism is set to match the number of CPU cores.
zh_cn: 如果应用是在一个本地执行环境中运行，并行度会设置为CPU的核心数目。

source: If the application was submitted to a Dispatcher or YARN Resource‐ Manager, it will spin up a JobManager, hand over the application, and the Job‐ Manager continues to execute the application.
zh_cn: 如果应用提交到Dispatcher或YARN ResourceManager，它们会启动一个JobManager并将应用转交给它，随后由JobManager负责继续执行应用。

source: If the application was submitted to a Dispatcher or YARN ResourceManager, it will spin up a JobManager and hand over the application, and the JobManager will start to execute the application.
zh_cn: 如果应用提交到Dispatcher或YARN ResourceManager，它们会启动一个JobManager并将应用转交给它，随后由JobManager负责执行该应用。

source: If the application was submitted to a JobManager, it immediately starts to execute the application.
zh_cn: 如果应用提交到JobManager，会立即开始执行；

source: If the barista runs out of milk right before preparing your cappuccino, you will have to
zh_cn: 如果咖啡师在给你准备卡布奇诺（译者注：一种需要牛奶和奶泡的咖啡）前刚好把牛奶用光了，那么你必须等他从供应间再拿一些出来。

source: If the barista runs out of milk right before preparing your cappuccino, you will have to wait until they bring some from the supply room.
zh_cn: 如果咖啡师在给你准备卡布奇诺（译者注：一种需要牛奶和奶泡的咖啡）前刚好把牛奶用光了，则你必须等他从补给室再拿一些出来。

source: If the command completed successfully, you will find a new target folder in your project folder.
zh_cn: 如果命令成功完成，你会在项目目录里看到一个新的target文件夹。

source: If the consumer is configured to read_committed, it stops consuming from a partition once it encoun‐ ters an uncommitted message and resumes when the message is committed.
zh_cn: 如果将一个消费者配置为read_committed，那么它一旦遇到一条未提交的消息，就会停止对该分区消费，直到消息被提交为止。

source: If the data type is a tuple, keys can be defined by simply using the field position of the corresponding tuple element.
zh_cn: 针对元组数据类型，你可以简单地使用元组相应元素的字段位置来定义键值。

source: If the event-time clock advances, the task processes all triggered timers and finally broadcasts its new event time to all downstream tasks by emitting a corresponding watermark to all con‐ nected output partitions.
zh_cn: 如果事件时间时钟向前推动，任务会先处理因此而触发的所有计时器，之后才会把对应的水位线发往所有连接的输出分区，以实现事件时间到全部下游任务的广播。

source: If the exter‐ nal sink system cannot atomically write multiple records—either all or none—
zh_cn: 如果外部数据汇系统不支持原子性地写入多个记录（全写或全不写），

source: If the input is a white square, it outputs the event unmodified.
zh_cn: 如果输入是白色方块，则不加改动直接输出；

source: If the input operators are in different groups, the operator is in the "default" group.
zh_cn: 如果输入算子属于不同的处理槽共享组，那么该算子则会被加入"default"组中。

source: If the key domain is continuously growing—for example, because the key is a unique transaction ID—you have to clean up state for keys that are no longer active to avoid memory problems.
zh_cn: 如果键值域（key domain）会持续增长（例如将唯一的事务ID作为键值），则必须对那些不再活跃的键值进行清理，以避免出现内存问题。

source: If the manifest file of your application JAR file does not specify an entry class, you can specify the class using the -c parameter:
zh_cn: 如果应用JAR包的manifest文件没有指定入口类，则你可以使用-c参数指定它：

source: If the master process needs to manage several applications or an application with many operators, you might need to increase the
zh_cn: 但如果主进程需要管理多个应用或某个应用具有很多算子，你可能需要利用jobmanager.heap.size配置项来增加JVM堆的容量。

source: If the master process that runs the active Dispatcher and JobManager fails, ZooKeeper elects a new Dispatcher as the leader.
zh_cn: 如果当前运行Dispatcher和JobManager的主进程出现故障，ZooKeeper就会选出一个新的Dispatcher作为领导者。

source: If the method is invoked from a submission cli‐ ent with a connection to a remote cluster, a remote execution environment is returned.
zh_cn: 如果是一个连接远程集群的提交客户端调用了该方法，则会返回一个远程执行环境；

source: If the method returns a nonnull value with a
zh_cn: 如果该方法的返回值非空，

source: If the number of partitions is larger than the number of subtasks, the default configuration results in empty parti‐ tions, which can cause problems for Flink applications consuming the topic in event- time mode.
zh_cn: 而如果分区数多于任务数，则默认配置会导致有些分区为空，此时若恰好有使用事件时间的Flink应用消费了该主题，那么可能会导致问题。

source: If the operator is configured just with an incremental aggregation func‐ tion, the current aggregation result is emitted.
zh_cn: 如果算子只是配置了一个增量聚合函数，就会发出当前聚合结果。

source: If the operator only has a full window function, the function is applied on all ele‐ ments of the window and the result is emitted as shown in Figure 6-5.
zh_cn: 如果算子只包含一个全量窗口函数，那么该函数将一次性作用于窗口内的所有元素上，之后便会发出结果。该情况如图6-5所示。

source: If the operator’s parallelism is larger than 128, the maximum parallelism is com‐ puted as the minimum of nextPowerOfTwo(parallelism + (parallelism / 2)) and 2^15.
zh_cn: 如果算子并行度大于128，那么最大并行度会取nextPowerOfTwo(parallelism + (parallelism / 2))和2^15之中的较小值。

source: If the parallelism is less than or equal to 128, the maximum parallelism is 128.
zh_cn: 如果并行度小于或等于128，则最大并行度会设置成128；

source: If the parallelism of your application depends on the environment’s default parallel‐ ism, Flink provides an atomic rescale command that takes a savepoint, cancels the application, and restarts it with a new default parallelism:
zh_cn: 针对应用程序并行度依赖环境默认并行度的情况，Flink提供了一个原子性的扩缩容命令，它可以生成一个保存点，取消应用，随后再以新的并行度将应用重启：

source: If the path refers to a file, the single file is read.
zh_cn: 如果路径指向一个文件，则读取该文件；

source: If the sender and receiver tasks run in separate Task‐ Manager processes, they communicate via the network stack of the operating system.
zh_cn: 如果发送端和接收端的任务运行在不同的TaskManager进程中，就需要利用操作系统的网络栈进行通信。

source: If the sender and receiver tasks run in separate TaskManager pro‐ cesses, they communicate via the network stack of the operating system.
zh_cn: 如果发送端和接收端的任务运行在不同的TaskManager进程中，它们就要用到操作系统的网络栈进行通信。

source: If the sink system closes a transaction (e.g., with a timeout), the not committed data will be lost.
zh_cn: 此时如果数据汇系统因为超时等原因将事务关闭，那么所有未提交的数据都将丢失。

source: If the slide is larger than the window size, some elements might not be assigned to any window and hence may be dropped.
zh_cn: 如果滑动间隔大于窗口大小，则一些元素可能不会分配给任何窗口，因此可能会被丢弃。

source: If the state backend does not contain state for the given descriptor, the state that is linked to the handle is initialized as empty.
zh_cn: 如果状态后端没包含给定描述符的对应状态，那么系统就会以空值来初始化句柄所关联的状态。

source: If the state of a task instance grows too large, the JVM and all task instances running on it can be killed due to
zh_cn: 如果某个任务实例的状态变得很大，那么它所在的JVM连同所有运行在该JVM之上的任务实例都可能由于OutOfMemoryError而终止。

source: If the state of an application is continuously increasing, it will at some point grow too large and kill the application unless action is taken to scale the application to more resources.
zh_cn: 应用状态如果不断增加，总有一天会变得过大并"杀死"应用，除非我们有什么办法能为应用不断扩充资源。

source: If the storage directory is not explicitly configured, RocksDB uses the value of the io.tmp.dirs parameter.
zh_cn: 如果没有显式指定该配置参数，RocksDB会使用io.tmp.dirs的值。

source: If the system continues to receive data at a higher rate than it can handle, buffers might become unavailable and data might get lost.
zh_cn: 如果系统持续以难以应对的高速率接收数据，缓冲区可能会用尽，继而可能导致数据丢失。

source: If the system continues to receive data at a higher rate than it can handle, buf‐
zh_cn: 如果系统持续以力不能及的高速率接收数据，那么缓冲区可能会用尽，继而可能导致数据丢失。

source: If the task fails during the first step, will the event get lost?
zh_cn: 如果故障发生在第一步，事件是否会丢失？

source: If the task is restarted due to a failure or from a save‐ point, the state will be initialized from the saved data.
zh_cn: 如果是重启任务（无论由于故障还是从保存点恢复）的情况，Flink就会用保存的数据初始化状态；

source: If the transaction cannot be com‐ mitted, the sink loses data.
zh_cn: 事务提交失败将导致数据汇丢失数据。

source: If the variable is not configured,
zh_cn: 如果该变量没有配置，

source: If the window only has an incremetal aggregation function (ReduceFunction or AggregateFunction) the current aggregation result is emit‐ ted.
zh_cn: 如果窗口只包含一个增量聚合函数（ReduceFunction或AggregateFunction），则直接发出当前聚合结果。

source: If the window operator has a ProcessWindowFunction, the function is called and the result is emitted.
zh_cn: 如果窗口算子配置了ProcessWindowFunction，就会调用该函数并发出结果；

source: If the window operator is configured with an incremental aggregation function, such as a ReduceFunction or AggregateFunction, the newly added element is immediately aggregated and the result is stored as the contents of the window.
zh_cn: 如果为窗口算子配置的是增量聚合函数（如ReduceFunction或AggregateFunction），那么新加入的元素会立即执行聚合，其结果会存为窗口内容。

source: If there are fewer list entries than the new parallelism of an operator, some tasks will start with empty state.
zh_cn: 如果列表条目的数量小于算子新设置的并行度，部分任务在启动时的状态就可能为空。

source: If there are more parallel subtasks than state objects, some subtasks are started with no state, and the restoreState() method is called with an empty list.
zh_cn: 如果并行子任务的数量多于状态对象，那么有些子任务在启动时就会获取不到状态，此时传入restoreState()方法的就会是一个空列表。

source: If this is not possible, for example because the application runs in a stand-alone cluster, the JobManager is not able to restart the application until enough slots become available.
zh_cn: 若无法完成（例如应用运行在一个独立集群上），JobManager将无法重启应用，直至有足够数量的可用处理槽。

source: If this is not possible—for example, because the application runs in a standalone cluster—the JobManager can not restart the application until enough slots become available.
zh_cn: 若无法完成（例如应用运行在一个独立集群上），JobManager将无法重启应用，直至有足够数量的可用处理槽。

source: If we only consider how much data we receive within one minute, our results will vary and depend on the speed of the network connection or the speed of the processing.
zh_cn: 如果我们仅考虑现实时间一分钟内收到多少数据，那结果可能会随网络连接速度或处理速度而改变。

source: If we want to reference a person’s ZIP code, we can use a field expression:
zh_cn: 如果我们想引用某人的邮政编码，可以使用字段表达式：

source: If you add a new stateful operator to the application or a new state to an existing operator, the state will be initialized as empty when the application is started from a savepoint.
zh_cn: 如果你向应用中添加了新的状态化算子或为已有算子增加了状态，那么在应用从保存点启动时，这些状态都会被初始化为空。

source: If you added a new state to the application or changed the unique identifier of a stateful operator, Flink will not find a corresponding state snapshot in the save‐ point.
zh_cn: 如果你向应用中添加了新的状态或改变了某个状态化算子的唯一标识，导致Flink无法在保存点中找到相应的状态快照，

source: If you are a Windows user, we recommend using the regular command-line client and running it on WSL or Cygwin.
zh_cn: 如果你是一名Windows用户，我们建议你在WSL或Cygwin下使用常规的命令行客户端。

source: If you are familiar with batch data processing APIs, functional programming languages, or SQL you will find the API concepts very easy to grasp.
zh_cn: 如果你熟悉批处理API、函数式编程语言或SQL，将会发现这里的API概念都很容易掌握。

source: If you are interested in learning more about real-world use cases and deployments, check out Apache Flink’s Powered By page and the talk recordings and slide decks of Flink For‐ ward presentations.
zh_cn: 如果还想了解更多的用例和部署方案，请查看Apache Flink的Powered By页面或Flink Forward的演讲录像及幻灯片。

source: If you are interested in learning more about real-world use cases and deployments, check out Apache Flink’s Powered By page and the talk recordings and slide decks of Flink Forward presentations.
zh_cn: 如果想了解更多真实用例和部署方案，请查看Apache Flink的用户页面或Flink Forward的演讲录像及幻灯片。

source: If you are not using an automatic clock synchronization service such as NTP, your machines' clocks might suffer from clock skew.
zh_cn: 如果你没有使用类似NTP的自动时钟同步服务，那么你机器的时钟可能会受到时钟偏差的影响。

source: If you are running Windows, we recom‐ mend to set up a virtual machine with Linux, Cygwin (a Linux environment for Win‐ dows), or the Windows Subsystem for Linux, which was introduced with Windows 10.
zh_cn: 如果你的系统是Windows，我们建议你配置一个Linux虚拟机，或安装Cygwin（一个Windows下的Linux环境），或设置Linux子系统（Win10中新加的功能）。

source: If you are the first customer showing up at the coffee shop right after it opened its doors in the morning, you will be served immediately.
zh_cn: 如果你是早晨咖啡店开门后第一个顾客，将立即得到服务。

source: If you are using Flink, you have nothing to worry about.
zh_cn: 如果你在使用Flink，那一切都无需担心。

source: If you cannot express your required join semantics using Flink’s built-in join opera‐ tors, you can implement custom join logic as a CoProcessFunction, BroadcastPro cessFunction, or KeyedBroadcastProcessFunction.
zh_cn: 如果Flink内置的Join算子无法表达所需的Join语义，那么你可以通过CoProcessFunction、BroadcastProcessFunction或KeyedBroadcastProcessFunction实现自定义的Join逻辑。

source: If you changed a state in the application—changed the state primitive or modified the data type of the state—the application fails to start.
zh_cn: 如果你对应用中的状态进行了修改，无论是改变了状态原语还是状态类型，都将导致应用无法启动。

source: If you click on a row, you trigger back-pressure sampling and you will see the
zh_cn: 点击某一行可以触发背压采样，你将看到持续约5秒钟的Sampling in progress...信息。

source: If you click on a running job, you can get a quick glimpse of running statistics per task or subtask as shown in Figure 10-3.
zh_cn: 如果点击一个正在运行的作业，你就可以打开像图10-3中所示的界面，继而快速了解每个任务或子任务的运行统计信息。

source: If you click on that job you will see the data flow and live metrics about the opera‐ tors of the running job similar to the screenshot in Figure 1-9.
zh_cn: 点击那个作业，你会看到和图1-9中的截图类似的数据流程及运行作业中算子的实时指标。

source: If you click on the History view, you can retrieve more fine-grained information, such as the status, trig‐ ger time, state size, and how many bytes were buffered during the checkpoint’s align‐ ment phase.
zh_cn: 点击History视图可以获取更多细粒度的信息，例如任务状态、触发时间、状态大小以及在检查点对齐阶段缓冲的字节数。

source: If you click on the Task Metrics tab, you can select more metrics from a dropdown menu, as shown in Figure 10-4.
zh_cn: 如果点击Task Metrics选项卡，你可以从下拉菜单中选择更多指标，具体如图10-4所示。

source: If you configure the minimum pause to be 30 seconds, then no new checkpoint will be started within the first 30 seconds after a checkpoint completed.
zh_cn: 如果你配置了30秒的最小暂停时间，那么在检查点完成后的30秒内不会开始生成新的检查点。

source: If you do not assign unique IDs to your operators with the uid()
zh_cn: 如果你没有使用uid()方法为算子分配唯一ID，

source: If you do not explicitly set unique identifiers to the operators of your stateful applica‐ tion, you will face significant limitations when you have to evolve the application.
zh_cn: 如果你没有为状态化应用的算子显式指定标识，那么在更新应用时就会受到诸多限制。

source: If you do not specify a savepointPath, the default savepoint directory as configured in the ./conf/flink-conf.yaml file is used (see “System Configuration”).
zh_cn: 如果没有指定savepointPath，系统会使用./conf/flink-conf.yaml文件中配置的默认保存点目录（请参阅"系统配置"一节）。

source: If you explic‐ itly specify a savepoint path, it is stored in the provided directory.
zh_cn: 如果你显式指定了保存点路径，它就会存到你所提供的目录中。

source: If you generate loose watermarks—where the watermarks are far behind the time‐ stamps of the processed records—you increase the latency of the produced results.
zh_cn: 如果生成的水位线过于宽松，即水位线远落后于已处理记录的时间戳，那么将导致产生结果的延迟增大。

source: If you have a ZooKeeper quorum running and Flink properly configured, you can use the regular ./bin/start-cluster.sh script to start a HA standalone cluster by adding addi‐ tional hostnames and ports to the ./conf/masters file.
zh_cn: 你如果有一个正在运行的ZooKeeper Quorum且已经配置好Flink，就可以通过向./conf/masters文件中添加额外的主机名和端口号的方式，使用常规的./bin/start-cluster.sh脚本来启动HA的独立集群。

source: If you have incremental aggregation logic but also need access to window metadata, you can combine a ReduceFunction or AggregateFunction, which perform incre‐ mental aggregation, with a ProcessWindowFunction, which provides access to more
zh_cn: 如果可用增量聚合表示逻辑且还需要访问窗口元数据，则可以将ReduceFunction或AggregateFunction与功能更强的ProcessWindowFunction组合使用。

source: If you look at how Flink propagates and updates watermarks (see “Watermark Propagation and Event Time”), you can see that a single operator that does not advance watermarks can grind all watermarks of an
zh_cn: 你如果了解了Flink的水位线传播和更新原理就会发现，一旦应用中引入了Shuffle操作（keyBy()和rebalance()等），那么单个算子水位线的停滞就将导致整个应用都停止工作。

source: If you need to work with different credentials, you should start a new cluster.
zh_cn: 如果你需要使用不同的证书，请启动一个新的集群。

source: If you removed a state from the application or changed the unique identifier of a stateful operator, there is state in the savepoint that cannot be matched to the application.
zh_cn: 如果你从应用中删除了某个状态或改变了某个状态化算子的唯一标识，导致保存点中存在无法和应用匹配的状态，

source: If you require exactly-once results, you should take the savepoint and stop the appli‐ cation with the integrated savepoint-and-cancel command.
zh_cn: 你如果需要精确一次的结果，则应该使用复合命令savepoint-and-cancel来生成保存点并停止应用。

source: If you run Hadoop YARN version 2.6 or later, Flink automat‐ ically configures an attempt failure’s validity interval.
zh_cn: 如果你使用的是Hadoop YARN 2.6或之后的版本，Flink会自动配置尝试失败的有效时间间隔。

source: If you run applications with many dependencies, the JVM’s nonheap memory can also grow significantly because it stores all TaskManager and user-code classes.
zh_cn: 如果你运行的应用有很多依赖，则JVM的堆外内存也会增长比较严重，因为它需要存储所有TaskManager和用户代码类。

source: If you run the application in a local environ‐ ment—or example, from your IDE—on a machine with 8 cores, the source task will run with 8 tasks, the mapper with 16 tasks, and the sink with 2 tasks.
zh_cn: 如果你在一台8核的机器上以本地环境中运行（例如在IDE里），那么数据源将会运行8个任务，map将运行16个任务，数据汇将运行2个任务。

source: If you run the docker images command after the build script finishes, you should see a new Docker image called flink-book-apps.
zh_cn: 如果在构建脚本完成后运行docker images命令，你应该能看到一个名为flink-book-apps的新的Docker镜像。

source: If you run the following command, the example application from “A Quick Look at Flink” on page 12 is deployed on one master and three worker containers to Docker:
zh_cn: 如果运行以下命令，就可以将第12页"Flink快览"中的示例应用部署在Docker的一个主容器和三个工作容器上：

source: If you take a step back and read the introductory example once more, you hopefully have a better idea about what is going on.
zh_cn: 此时回头再看一次开篇示例，希望你能对它的行为有一个更好的理解。

source: If you want to use a filesystem source connector in an event-time application, you should be aware that it can be challenging to generate watermarks since input splits are generated in a single process and round-robin distributed to all parallel readers
zh_cn: 当你想在一个基于事件时间的应用中使用文件系统数据源连接器时需要注意，生成水位线的工作可能并不好做。因为输入划分是在单个进程中生成的，且会被循环发送至所有并行读取器，

source: If you want to use a metrics backend that is not included in the above list, you can also define your own reporter by implementing the org.apache.flink.met‐ rics.reporter.MetricReporter interface.
zh_cn: 如果你想使用的指标后端没有在上表中列出，则可以通过实现org.apache.flink.metrics.reporter.MetricReporter接口来自定义汇报器。

source: If you would like to customize the handling the latency marker at opera‐
zh_cn: 如果你想在算子中自定义延迟标记处理逻辑，

source: If you, for example, specify fs.default-scheme: hdfs://nnode1:9000, the path /result will be extended to hdfs://nnode1:9000/result.
zh_cn: 举例而言，如果指定了fs.default-scheme:hdfs://nnode1:9000，则/result路径将自动被扩充为hdfs://nnode1:9000/result。

source: If your application requires keyed state for a moving key domain, it should ensure the state of keys is cleared when it is not needed anymore.
zh_cn: 如果你的应用需要用到键值域不断变化的键值分区状态，那么必须要确保能够对那些无用的状态进行清除。

source: If your applica‐ tion is a batch job, you can easily fix the bug offline and then redeploy the new application code once the current job instance finishes.
zh_cn: 如果应用是一个批处理作业，则你可以很轻松地离线修复Bug，然后等当前作业实例结束后部署新的应用代码即可。

source: If your function requires a nonserializable object instance, you can either implement it as a rich function and initialize the nonserializ‐
zh_cn: 如何你有函数需要一个无法序列化的对象实例，可以选择使用富函数（rich function）在open()方法中将其初始化

source: If your input elements have timestamps that are
zh_cn: 如果你输入元素的时间戳是单调增加的，

source: If—according to the configured checkpointing interval—a checkpoint needs to be started, but there is another checkpoint in progress, the sec‐ ond checkpoint will be put on hold until the first checkpoint completes.
zh_cn: 如果（根据配置的检查点生成间隔）需要生成一个检查点时，另一个检查点正在生成过程中，则后一个检查点会延后，直至前一个完成。

source: Imagine that during Christmas holiday season, baristas have to draw a Santa Claus on the cup of each coffee they serve.
zh_cn: 假设正值圣诞假期，咖啡师要在他们端出的每一杯咖啡上面画一个圣诞老人。

source: Imagine that during the Christmas holiday season, baristas have to draw a Santa Claus on the cup of each coffee they serve.
zh_cn: 假设现在正值圣诞假期，咖啡师要在他们完成的每杯咖啡的杯子上画一个圣诞老人。

source: Implement Your Applications With Evolution in Mind
zh_cn: 实现应用时须长远考虑

source: Implementation
zh_cn: 实现

source: Implementation of a CoProcessFunction that dynamically filters a stream of sensor readings
zh_cn: 动态过滤传感器读数流的CoProcessFunction实现

source: Implementation of a ProcessWindowFunction that assigns the window end timestamp to an incrementally computed result
zh_cn: 用于将窗口结束时间戳和递增计算结果组合的ProcessWindowFunction实现：

source: Implementation of a WatermarkGauge metric that exposes the current watermark
zh_cn: 对外提供当前水位线的WatermarkGauge指标的实现

source: Implementing Functions
zh_cn: 实现函数

source: Implementing Functions | 105
zh_cn: 实现函数 | 105

source: Implementing Operator List State with the ListCheckpointed Interface
zh_cn: 通过ListCheckpointed接口实现算子列表状态

source: Implementing Stateful Functions
zh_cn: 实现状态化函数

source: Implementing Stateful Functions | 155
zh_cn: 实现状态化函数 | 155

source: Implementing Stateful Functions | 161
zh_cn: 实现状态化函数 | 161

source: Implementing Stateful Functions | 163
zh_cn: 实现状态化函数 | 163

source: Implementing a Custom Sink Function
zh_cn: 实现自定义数据汇函数

source: Implementing a Custom Sink Function | 207
zh_cn: 实现自定义数据汇函数 | 207

source: Implementing a Custom Sink Function | 211
zh_cn: 实现自定义数据汇函数 | 211

source: Implementing a Custom Sink Function | 213
zh_cn: 实现自定义数据汇函数 | 213

source: Implementing a Custom Source Function
zh_cn: 实现自定义数据源函数

source: Implementing a Custom Source Function | 203
zh_cn: 实现自定义数据源函数 | 203

source: Implementing a FlatMapFunction with a keyed ValueState
zh_cn: 实现带有键值分区ValueState的FlatMapFunction

source: Implementing a KeyedBroadcastProcessFunction
zh_cn: 实现KeyedBroadcastProcessFunction

source: Implementing a streaming application with queryable state is easy.
zh_cn: 实现一个支持可查询式状态的流式应用非常简单。

source: Import the Book’s Examples in an IDE
zh_cn: 在IDE中导入书中示例

source: Import the book examples repository into IntelliJ
zh_cn: 将书中示例仓库导入IntelliJ

source: Import the book’s examples in your IDE
zh_cn: 将书中示例导入你的IDE

source: Importing the examples-scala repository into your IDE to experiment with Flink is a good first step.
zh_cn: 将examples-scala库导入IDE来体验Flink是一个良好的开端。

source: Improving on the first generation, the next generation of distributed open source stream processors (2013) provided better failure guarantees and ensured that in case of a failure each input record affects the result exactly once.
zh_cn: 和第一代开源分布式流处理引擎相比，第二代引擎（2013年）提供了更加完善的故障处理机制——即便出现故障，也能保证每条记录仅参与一次结果运算。

source: Improving on the first generation, the next generation of distributed open source stream processors (2013) provided better failure guarantees and ensured that in case of a failure each record contributes exactly once to the result.
zh_cn: 和第一代开源分布式流处理引擎相比，第二代引擎（2013年）提供了更加完善的故障处理机制，可以保证在出错的情况下每条记录也仅参与一次结果运算。

source: In ./conf/flink-conf.yaml you need to set a cluster identifier for each running cluster.
zh_cn: 在./conf/flink-conf.yaml中为每个运行的集群设置集群标识符。

source: In Chapter 10, we show how to disable task chaining for an application and how to control the chaining behavior of individual opera‐ tors.
zh_cn: 在第10章中，我们会展示如何对某一应用内禁用任务链接以及如何单独控制每个算子的链接行为。

source: In Chapter 2, we highlighted the importance of time semantics for stream processing applications and explained the differences between processing-time and event-time.
zh_cn: 在第二章里，我们强调了时间语义对于流处理应用的重要性并解释了处理时间和事件时间的不同。

source: In Chapter 9, we will discuss how to setup and configure Flink for different environments.
zh_cn: 在第9章里，我们会讨论如何针对不同环境搭建及配置Flink。

source: In Figure 2-2, the output of the “Extract hashtags” operator is partitioned by key (the hashtag), so that the count operator tasks can correctly compute the occurrences of each hashtag.
zh_cn: 图2-2中，"Extract hashtags"算子的输出就是按照键值（主题标签）划分的，因此下游的计数算子可以正确计算出每个主题标签的出现次数。
